app/controllers/golf_course_organizers_controller.rb

	def index
		@golf_course_organizers = GolfCourseOrganizer.all
---
SELECT "golf_course_organizers".* FROM "golf_course_organizers"

    def show
    	@golf_course_organizer = GolfCourseOrganizer.find(params[:id])
---
SELECT  "golf_course_organizers".* FROM "golf_course_organizers" WHERE "golf_course_organizers"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]