app/controllers/golf_courses_controller.rb

INSERT INTO "golf_courses" ("name", "created_at", "updated_at", "location") VALUES (?, ?, ?, ?)  [["name", "first"], ["created_at", 2016-10-05 23:15:25 UTC], ["updated_at", 2016-10-05 23:15:25 UTC], ["location", "here"]]
---
	def create
	  @golf_course = GolfCourse.new(golf_course_params)

	  result = Address.existance(@golf_course.address.streetNumber, @golf_course.address.streetName, @golf_course.address.city, @golf_course.address.province, @golf_course.address.country, @golf_course.address.postalCode)
	  if result != nil
		@golf_course.errors[:base] << "This address already exists!"

SELECT  "golf_courses".* FROM "golf_courses" WHERE "golf_courses"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
---
	def show
		@golf_course = GolfCourse.find(params[:id])