app/controllers/people_controller.rb

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 1]]
---

		@person.destroy
		@address.destroy
		@user.destroy