app/controllers/teams_controller.rb

   def create()
      @team = Team.new(team_params)
      @team.save
---
INSERT INTO "teams" ("name", "tournament_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "a"], ["tournament_id", 1], ["created_at", 2016-10-10 19:45:47 UTC], ["updated_at", 2016-10-10 19:45:47 UTC]]

   def update
      @team = Team.find(params[:id])
      @team.update(team_params)
---
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "teams" SET "tournament_id" = ?, "updated_at" = ? WHERE "teams"."id" = ?  [["tournament_id", 9], ["updated_at", 2016-10-10 19:46:42 UTC], ["id", 16]]

   def destroy
      @team = Team.find(params[:id])
      @team.destroy
---
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "teams" WHERE "teams"."id" = ?  [["id", 2]]