app/controllers/tournaments_controller.rb

SELECT "tournaments".* FROM "tournaments"
---
	def index
		@tournaments = Tournament.order(sort_column + " " + sort_direction)

INSERT INTO "tournaments" ("name", "description", "ispublic", "extrafeatures", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "asd"], ["description", "q"], ["ispublic", false], ["extrafeatures", ""], ["created_at", 2016-10-20 02:17:54 UTC], ["updated_at", 2016-10-20 02:17:54 UTC]]
---
	def create
		@tournament = Tournament.new(params.require(:tournament).permit(:name, :description, :ispublic, :extrafeatures, :date, :golf_course_id, :pricePlayer, :priceSpectator, :priceSponsor, :currency, :image))
		if @tournament.save

SELECT  "tournaments".* FROM "tournaments" WHERE "tournaments"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
	def show
		@tournament = Tournament.find(params[:id])

SELECT  "tournaments".* FROM "tournaments" WHERE "tournaments"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
	def edit
		@tournament = Tournament.find(params[:id])

SELECT  "tournaments".* FROM "tournaments" WHERE "tournaments"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "tournaments" SET "ispublic" = ?, "updated_at" = ? WHERE "tournaments"."id" = ?  [["ispublic", true], ["updated_at", 2016-10-20 02:17:56 UTC], ["id", 7]]
---
	def update
		@tournament = Tournament.find(params[:id])
		if @tournament.update(params.require(:tournament).permit(:name, :description, :ispublic, :extrafeatures, :date, :golf_course_id, :pricePlayer, :priceSpectator, :priceSponsor, :currency, :image))