app/controllers/website_admins_controller.rb

	def index
		@website_admins = WebsiteAdmin.all
---
SELECT "website_admins".* FROM "website_admins"

	def destroy
		@website_admin = WebsiteAdmin.find(params[:id])
		@website_admin.person.destroy #delete corresponding person object
---
SELECT  "website_admins".* FROM "website_admins" WHERE "website_admins"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
DELETE FROM "website_admins" WHERE "website_admins"."id" = ?  [["id", 5]]